ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
// Waveshare ESP32-P4-WIFI6-Touch-LCD-3.5 인터넷 스트리밍 FM 라디오
//
// 세 번째 보드. 앞의 둘(ESP32-S3)과 코덱(ES8311)은 같아서 오디오 경로는 핀
// 번호만 다르고, 근본적으로 다른 것은 둘이다.
//
// 1) 무선이 P4 안에 없다. 옆의 ESP32-C6 가 SDIO 로 Wi-Fi 를 대신한다
//    (ESP-Hosted). Arduino 3.3 이 감춰 주어 WiFi.begin() 은 그대로지만,
//    부팅에 C6 리셋 1.5초가 더 들고, 호스트와 C6 펌웨어의 버전이 맞아야 한다.
//    부팅 로그에 두 버전이 찍힌다.
//
// 2) 화면이 크고 터치가 된다. 버튼 대신 화면을 눌러 조작한다. 조작 방법은
//    ui.h 에. 전원은 AXP2101 이 진짜로 끊고, PWR 버튼으로 다시 켠다.
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <Audio.h>
#include <Preferences.h>
#include <WiFi.h>
#include <Wire.h>
#include <atomic>
#include <esp_system.h>

#include "c6update.h"
#include "config.h"
#include "es8311.h"
#include "hw.h"
#include "log.h"
#include "listening.h"
#include "networkhealth.h"
#include "secrets.h"
#include "stations.h"
#include "touch.h"
#include "ui.h"
#include "wifisetup.h"

#if CONFIG_ESP_HOSTED_ENABLED
#include "esp32-hal-hosted.h"
#endif

// ── 상수 ──────────────────────────────────────────────────────────
constexpr uint8_t  kVolumeSteps     = 20;
constexpr uint8_t  kDefaultVolume   = 12;
constexpr uint8_t  kDefaultIndex    = 2;      // KBS Classic FM 93.1
constexpr uint32_t kWifiFirstTryMs  = 25000;
constexpr uint32_t kWifiRetryMs     = 15000;
constexpr uint8_t  kWifiAttempts    = 3;
constexpr uint32_t kWifiRecoveryMs  = 30000;
constexpr uint32_t kWifiLostRestartMs = 45000;  // 끊긴 채 이만큼 지나면 재시작
constexpr uint32_t kStatusPeriodMs  = 60000;
constexpr uint32_t kUiPeriodMs      = 1000;
constexpr uint32_t kTouchPeriodMs   = 20;     // 50Hz 폴링
constexpr uint32_t kDragFrameMs     = 50;     // 끄는 동안 다시 그리는 간격 (20fps)
constexpr uint32_t kRetryDelayMs    = 8000;
constexpr uint32_t kWifiPortalMs    = 5UL * 60 * 1000;

// ── 전역 ──────────────────────────────────────────────────────────
static Audio  audio;
static ES8311 codec;
static TaskHandle_t audioTaskHandle = nullptr;
static std::atomic<bool> wantMeters{false};
static std::atomic<uint32_t> lastPcmMs{0};
static std::atomic<uint32_t> audioWorkerMs{0};
static NetworkHealth networkHealth;
static bool networkRestartNeeded = false; // loop만 접근한다.

struct Shared : ListeningSettings {
    PlayState state = ST_BOOT;
    String    detail;
    uint32_t  bitrate = 0;
    HwPower   power;
    int16_t   wifiRssi = 0;
    uint8_t   wifiBars = 0;
    SleepTimer sleep;
    AudioMeters meters;
    uint32_t tuneRevision = 0;
    uint32_t prefsRevision = 0;
    bool maintenance = false;
    bool audioIdle = false;
    uint32_t maintenanceRevision = 0, idleRevision = 0;
};
static Shared            shared;
static SemaphoreHandle_t sharedLock;

static QueueHandle_t uiEventQueue;   // 터치 태스크 -> loop

static inline void lockShared()   { xSemaphoreTake(sharedLock, portMAX_DELAY); }
static inline void unlockShared() { xSemaphoreGive(sharedLock); }

// 라이브러리의 PCM 처리 경계에서 EQ 계수를 갱신한다. loop 태스크에서
// setTone() 을 호출하면 별도 디코더 태스크가 읽는 계수를 동시에 덮어쓸 수 있다.
void p4ProcessAudioFrame() {
    lastPcmMs.store(millis(), std::memory_order_relaxed);
    const bool meters = wantMeters.load(std::memory_order_relaxed);
    audio.settings.VU_LEVEL = meters;
    audio.settings.SPECTRUM = meters;
    static uint8_t appliedTone = UINT8_MAX;
    lockShared();
    const uint8_t toneIndex = shared.tone;
    unlockShared();
    if (toneIndex != appliedTone) {
        const auto& tone = kTonePresets[toneIndex];
        audio.setTone(tone.bass, tone.mid, tone.treble);
        appliedTone = toneIndex;
    }
}

static void setState(PlayState st, const String& detail = String()) {
    lockShared();
    shared.state = st;
    shared.detail = detail;
    unlockShared();
}

// ── 설정 저장 ─────────────────────────────────────────────────────
// PMIC 가 전원을 진짜로 끊으면 RTC 메모리도 같이 날아간다. NVS 에 둔다.
static void loadPrefs() {
    Preferences p;
    if (p.begin("radio", true)) {
        const uint8_t idx = p.getUChar("station", kDefaultIndex);
        const uint8_t vol = p.getUChar("volume", kDefaultVolume);
        const uint8_t tone = p.getUChar("tone", 0);
        // 타이머 도중 재부팅되면 남은 시간을 추정해 계속 틀지 않고 정지한다.
        // 외장 RTC 가 없으므로 NTP 접속 실패 때도 같은 보수적인 동작을 한다.
        const bool paused = p.getBool("paused", false) || p.getBool("sleepArmed", false);
        p.end();
        lockShared();
        shared.index = (idx < kStationCount) ? idx : kDefaultIndex;
        shared.volume = (vol <= kVolumeSteps) ? vol : kDefaultVolume;
        shared.tone = tone;
        shared.paused = paused;
        shared.validate(kStationCount, kVolumeSteps);
        unlockShared();
    }
}

static uint32_t savedPrefsRevision = 0;
static bool savePrefs() {
    lockShared();
    const uint8_t idx = shared.index, vol = shared.volume;
    const uint8_t tone = shared.tone;
    const bool paused = shared.paused;
    const bool sleepArmed = shared.sleep.minutes() != 0;
    const uint32_t revision = shared.prefsRevision;
    unlockShared();
    Preferences p;
    if (p.begin("radio", false)) {
        const bool ok = p.putUChar("station", idx) && p.putUChar("volume", vol) &&
                        p.putUChar("tone", tone) && p.putBool("paused", paused) &&
                        p.putBool("sleepArmed", sleepArmed);
        p.end();
        if (ok) savedPrefsRevision = revision;
        else RLOGE("청취 설정 저장 실패");
        return ok;
    }
    RLOGE("청취 설정 저장소 열기 실패");
    return false;
}

// 슬라이더를 움직이는 동안 플래시를 계속 쓰지 않고 마지막 변경 1.5초 뒤 저장.
static void flushPrefsWhenIdle() {
    static uint32_t observed = 0, changedAt = 0;
    lockShared();
    const uint32_t revision = shared.prefsRevision;
    unlockShared();
    if (revision != observed) { observed = revision; changedAt = millis(); }
    if (revision != savedPrefsRevision && millis() - changedAt >= 1500) {
        savePrefs();
        changedAt = millis();
    }
}

static void tickSleepTimer() {
    lockShared();
    const bool expired = shared.sleep.expire(millis());
    if (expired) {
        shared.paused = true;
        ++shared.tuneRevision;
        ++shared.prefsRevision;
    }
    unlockShared();
    if (expired) RLOGI("취침 타이머 만료 — 재생 중지");
}

