ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
// ── 시각 ──────────────────────────────────────────────────────────
static bool haveTime = false;

static void syncNtp() {
    if (WiFi.status() != WL_CONNECTED) return;
    RLOGI("NTP 동기화 시도...");
    configTzTime(NTP_TZ, NTP_SERVER1, NTP_SERVER2);
    struct tm t = {};
    if (getLocalTime(&t, NTP_TIMEOUT_MS)) {
        haveTime = true;
        RLOGI("NTP 완료: %04d-%02d-%02d %02d:%02d", t.tm_year + 1900, t.tm_mon + 1,
              t.tm_mday, t.tm_hour, t.tm_min);
    } else {
        RLOGE("NTP 응답 없음");
    }
}

// ── Wi-Fi ─────────────────────────────────────────────────────────
static void applyWifiPowerSave(bool playing) {
    const bool sleepOn = playing ? WIFI_SLEEP_WHILE_PLAYING : WIFI_SLEEP_WHILE_IDLE;
    WiFi.setSleep(sleepOn ? WIFI_PS_MIN_MODEM : WIFI_PS_NONE);
    RLOGI("Wi-Fi 모뎀 슬립: %s (%s)", sleepOn ? "on" : "off", playing ? "재생" : "유휴");
}

// ── 볼륨 ──────────────────────────────────────────────────────────
static float volumeToDb(uint8_t vol) { return -40.0f + 2.0f * (float)vol; }

static void applyVolume() {
    lockShared();
    const uint8_t vol = shared.volume;
    const bool    paused = shared.paused;
    unlockShared();
    if (paused) return;

    if (vol == 0) {
        codec.setMute(true);
    } else {
        codec.setMute(false);
        codec.setVolumeDb(volumeToDb(vol));
    }
}

// ── 오디오 태스크 ─────────────────────────────────────────────────
static void tune(uint8_t index) {
    if (index >= kStationCount) return;
    const Station& st = kStations[index];

    audio.stopSong();
    lastPcmMs.store(0, std::memory_order_relaxed);
    lockShared();
    shared.meters = {};
    shared.bitrate = 0;
    unlockShared();
    setState(ST_TUNING);
    RLOGI("선국: %s (%.1f MHz)", st.name, st.freq);

    const String url = resolveStreamUrl(st);
    if (url.isEmpty()) {
        setState(ST_ERROR, "NO STREAM");
        return;
    }
    // URL 해석을 기다리는 동안 바뀐 선국/정지 요청은 재생을 시작하지 않는다.
    lockShared();
    const bool cancelled = shared.paused || shared.maintenance || shared.index != index;
    unlockShared();
    if (cancelled) return;
    if (!audio.connecttohost(url.c_str())) {
        setState(ST_ERROR, "CONNECT FAIL");
        return;
    }
    applyVolume();
    setState(ST_BUFFERING);
}

static void pauseAudio() {
    RLOGI("일시정지 — 스트림 종료");
    audio.stopSong();
    codec.setMute(true);
    hwSpeakerAmp(false);
    applyWifiPowerSave(false);

    lockShared();
    shared.state = ST_PAUSED;
    shared.bitrate = 0;
    shared.meters = {};
    unlockShared();
}

static void resumeAudio(uint8_t idx) {
    RLOGI("재개");
    applyWifiPowerSave(true);
    hwSpeakerAmp(true);

    applyVolume();
    tune(idx);
}

static void audioTask(void*) {
    uint32_t lastRetryMs = millis();
    uint32_t bufferingSince = 0;
    ListeningSettings applied;
    uint32_t appliedTune = 0;
    bool initialized = false;

    for (;;) {
        audioWorkerMs.store(millis(), std::memory_order_relaxed);
        tickSleepTimer();
        lockShared();
        const ListeningSettings desired = shared;
        const uint32_t revision = shared.tuneRevision;
        const bool maintenance = shared.maintenance;
        const uint32_t maintenanceRevision = shared.maintenanceRevision;
        const bool idle = shared.audioIdle && shared.idleRevision == maintenanceRevision;
        unlockShared();
        if (maintenance) {
            bufferingSince = 0;
            if (!idle) {
                pauseAudio();
                lockShared();
                shared.audioIdle = true;
                shared.idleRevision = maintenanceRevision;
                unlockShared();
            }
            initialized = false;
            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }
        lockShared();
        shared.audioIdle = false;
        unlockShared();

        // 전송/코덱 변경은 이 태스크만 한다(EQ 는 위 PCM 콜백). 큐가 차서 마지막 탭이
        // 사라지지 않도록, 선국 중에도 요청은 최신 상태로 합쳐 둔다.
        if (desired.paused) bufferingSince = 0;
        switch (listeningChange(desired, applied, initialized, revision, appliedTune)) {
            case PlaybackChange::PAUSE: pauseAudio(); break;
            case PlaybackChange::RESTART:
                bufferingSince = 0;
                resumeAudio(desired.index);
                break;
            case PlaybackChange::VOLUME: applyVolume(); break;
            case PlaybackChange::NONE: break;
        }
        applied = desired;
        appliedTune = revision;
        initialized = true;
        if (desired.paused) {
            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }

        audio.loop();

        // isRunning()은 소켓 연결 직후에도 true다. 실제 디코딩된 PCM으로 재생을
        // 판정해야 데이터가 끊겼을 때 ON AIR에 머물지 않고 스톨 복구로 들어간다.
        constexpr uint32_t kStallMs = 45000;
        bool stalled = false;
        const uint32_t pcmAt = lastPcmMs.load(std::memory_order_relaxed);
        const bool receivingAudio = pcmAt && millis() - pcmAt < 1500 && audio.isRunning();

        lockShared();
        if (shared.state == ST_BUFFERING && receivingAudio) shared.state = ST_PLAYING;
        else if (shared.state == ST_PLAYING && !receivingAudio) shared.state = ST_BUFFERING;
        if (shared.state == ST_BUFFERING) {
            if (!bufferingSince) bufferingSince = millis();
            else if (millis() - bufferingSince > kStallMs) {
                shared.state = ST_ERROR;
                shared.detail = "STREAM STALL";
                bufferingSince = 0;
                stalled = true;
            }
        } else {
            bufferingSince = 0;
        }
        const PlayState st = shared.state;
        const uint8_t   idx = shared.index;
        unlockShared();
        if (stalled) {
            RLOGE("스트림이 %lu초 넘게 시작되지 않음 — 다시 붙는다",
                  (unsigned long)(kStallMs / 1000));
        }

        if (st == ST_ERROR && WiFi.status() == WL_CONNECTED) {
            if (millis() - lastRetryMs > kRetryDelayMs) {
                bufferingSince = 0;
                tune(idx);
                // DNS/TCP 실패 자체가 8초 이상 걸려도 즉시 재시도하지 않는다.
                lastRetryMs = millis();
            }
        } else if (st != ST_ERROR) {
            lastRetryMs = millis();
        }

