ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
        vTaskDelay(1);
    }
}

// ── 화면 상태 ─────────────────────────────────────────────────────
static UiState snapshotUi() {
    UiState u;
    lockShared();
    u.index = shared.index;
    u.state = shared.state;
    u.detail = shared.detail;
    u.paused = shared.paused;
    u.volume = shared.volume;
    u.bitrate = shared.bitrate;
    u.battery = shared.power.battery;
    u.vbus = shared.power.vbus;
    u.charging = shared.power.charging;
    u.battPercent = shared.power.percent;
    u.battVolts = shared.power.battMv / 1000.0f;
    u.wifiRssi = shared.wifiRssi;
    u.wifiBars = shared.wifiBars;
    u.tone = shared.tone;
    u.sleepMinutes = shared.sleep.minutes();
    u.sleepSeconds = shared.sleep.remainingSeconds(millis());
    u.meters = shared.meters;
    u.controlsBlocked = shared.maintenance || shared.state == ST_BOOT || shared.state == ST_WIFI ||
                        shared.state == ST_WIFISETUP || shared.state == ST_UPDATING;
    u.controlsEpoch = shared.maintenanceRevision;
    unlockShared();
    if (u.paused || u.state != ST_PLAYING || millis() - u.meters.updatedMs > 500) u.meters = {};

    u.freq = kStations[u.index].freq;
    u.name = kStations[u.index].name;
    u.volumeMax = kVolumeSteps;
    u.wifi = WiFi.status() == WL_CONNECTED;

    struct tm now = {};
    if (haveTime && getLocalTime(&now, 5)) {
        u.hasTime = true;
        u.hour = (uint8_t)now.tm_hour;
        u.minute = (uint8_t)now.tm_min;
    }
    return u;
}

static uint8_t rssiToBars(int32_t rssi) {
    // 구형 C6 펌웨어는 RSSI 질의(Req_WifiStaGetApInfo)에 답하지 않아 0 이 온다.
    // 붙어는 있으니 끊긴 것처럼 보이지 않게 중간으로 그린다.
    if (rssi == 0) return 2;
    if (rssi >= -55) return 4;
    if (rssi >= -65) return 3;
    if (rssi >= -75) return 2;
    if (rssi >= -85) return 1;
    return 0;
}

static void pollSlowStatus() {
    const bool up = WiFi.status() == WL_CONNECTED;
    const int16_t rssi = up ? (int16_t)WiFi.RSSI() : 0;
    const HwPower pw = hwReadPower();

    lockShared();
    shared.wifiRssi = rssi;
    shared.wifiBars = up ? rssiToBars(rssi) : 0;
    shared.power = pw;
    const bool playbackBlocked = !shared.paused && !shared.maintenance &&
        (shared.state == ST_TUNING || shared.state == ST_BUFFERING || shared.state == ST_ERROR);
    unlockShared();
    networkRestartNeeded = networkHealth.observe(up, rssi, playbackBlocked);
    const uint32_t workerAt = audioWorkerMs.load(std::memory_order_relaxed);
    if (audioWorkerStalled(millis(), workerAt, lastPcmMs.load(std::memory_order_relaxed))) {
        RLOGE("오디오 태스크가 90초 이상 반환하지 않고 PCM도 중단됨");
        networkRestartNeeded = true;
    }

    const uint32_t bufSize = audio.getInBufferSize();
    const uint32_t bufPct = bufSize ? (audio.inBufferFilled() * 100 / bufSize) : 0;
    const UiTiming ut = uiTakeTiming();
    // 버퍼는 퍼센트와 함께 크기도 적는다. PSRAM 이 크면 라이브러리가 버퍼를 크게
    // 잡아서, 같은 몇 초치가 S3 보드보다 작은 퍼센트로 보인다.
    RLOGI("배터리 %u%% (%.2fV%s%s%s)  VBUS %.2fV  Wi-Fi %ddBm  버퍼 %u%%/%uKB  힙 %u  가동 %lu분  "
          "화면 %u장 그리기 %u/%ums 전송 %u/%ums",
          (unsigned)pw.percent, pw.battMv / 1000.0f, pw.battery ? "" : ", 셀 없음",
          pw.charging ? ", 충전중" : "", pw.vbus ? ", USB" : "", pw.vbusMv / 1000.0f,
          (int)rssi, (unsigned)bufPct, (unsigned)(bufSize / 1024), (unsigned)ESP.getFreeHeap(),
          (unsigned long)(millis() / 60000), (unsigned)ut.frames, (unsigned)ut.drawAvg,
          (unsigned)ut.drawMax, (unsigned)ut.flushAvg, (unsigned)ut.flushMax);
    const uint32_t pcmAt = lastPcmMs.load(std::memory_order_relaxed);
    lockShared();
    const unsigned state = shared.state, station = shared.index;
    unlockShared();
    RLOGI("PCM 수신 %s (마지막 %lu ms 전), 작업 응답 %lu ms 전, 상태 %u, 채널 %u",
          pcmAt ? "있음" : "없음", (unsigned long)(pcmAt ? millis() - pcmAt : 0),
          (unsigned long)(workerAt ? millis() - workerAt : 0), state, station);
}

// ── 터치 태스크 ───────────────────────────────────────────────────
// 화면 한 장을 SPI 로 밀어 넣는 동안 loop 는 멈춘다. 그 사이에 들어온 탭을
// 놓치지 않으려면 터치는 따로 돌아야 한다. 결과(UiEvent)는 큐로 loop 에 넘긴다.
static void touchTask(void*) {
    TouchPoint pts[2];
    for (;;) {
        const uint8_t n = touchRead(pts, 2);
        const UiState s = snapshotUi();
        UiEvent ev = uiHandleTouch(pts, n, s);
        ev.epoch = s.controlsEpoch;
        // loop 가 잠깐 느려져도 버튼의 마지막 뗌을 버리지 않는다.
        if (ev.action != UiAction::NONE) xQueueSend(uiEventQueue, &ev, portMAX_DELAY);
        vTaskDelay(pdMS_TO_TICKS(kTouchPeriodMs));
    }
}

// ── 전원 끄기 ─────────────────────────────────────────────────────
static void endMaintenance() {
    xQueueReset(uiEventQueue);
    lockShared();
    shared.maintenance = false;
    ++shared.tuneRevision;
    unlockShared();
}

static bool beginMaintenance() {
    lockShared();
    shared.maintenance = true;
    const uint32_t revision = ++shared.maintenanceRevision;
    unlockShared();
    if (!audioTaskHandle) return true;
    const uint32_t started = millis();
    while (millis() - started < 45000) {
        lockShared();
        const bool idle = shared.audioIdle && shared.idleRevision == revision;
        unlockShared();
        if (idle) return true;
        delay(10);
    }
    // 잠금이나 네트워크 호출 도중 태스크를 강제 정지하면 교착될 수 있다.
    RLOGE("오디오 정지 대기 시간 초과 — 작업 취소");
    endMaintenance();
    return false;
}

static void powerOff(const char* why) {
    RLOGI("전원 끔 (%s)", why);
    if (!beginMaintenance()) return;
    WiFi.disconnect(true);
    savePrefs();
    uiScreenOff();
    Serial.flush();
    delay(50);
    hwPowerOff();   // 돌아오지 않는다
}

// ── Wi-Fi 접속 ────────────────────────────────────────────────────
static volatile uint8_t lastWifiReason = 0;

static void onWifiEvent(arduino_event_id_t id, arduino_event_info_t info) {
    if (id == ARDUINO_EVENT_WIFI_STA_DISCONNECTED) {
        lastWifiReason = info.wifi_sta_disconnected.reason;
        RLOGI("Wi-Fi 끊김 (reason=%u)", (unsigned)lastWifiReason);
    }
}

static String wifiReasonText() {
    const uint8_t r = lastWifiReason;
    if (!r) return String();
    const char* what = "";
    switch (r) {
        case 2:   what = " auth expire"; break;
        case 15:  what = " handshake"; break;
        case 201: what = " no AP"; break;
        case 202: what = " auth fail"; break;
        case 205: what = " conn fail"; break;
        default:  break;
    }
    return "fail r" + String((unsigned)r) + what;
}

static bool wifiRecovery = false;

// 슬레이브가 버전을 말해 주지 않으면(구형 펌웨어) true.
static bool logHostedVersions() {
#if CONFIG_ESP_HOSTED_ENABLED
    uint32_t hM, hm, hp, sM, sm, sp;
    hostedGetHostVersion(&hM, &hm, &hp);
    hostedGetSlaveVersion(&sM, &sm, &sp);
    RLOGI("ESP-Hosted 호스트 %lu.%lu.%lu / C6 슬레이브 %lu.%lu.%lu%s",
          (unsigned long)hM, (unsigned long)hm, (unsigned long)hp,
          (unsigned long)sM, (unsigned long)sm, (unsigned long)sp,
          (hM == sM && hm == sm) ? "" : "  <- 버전 불일치");
    return (sM == 0 && sm == 0 && sp == 0);
#else
    return false;
#endif
}

