ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
// 공장 출하 C6 펌웨어는 리셋 뒤 한동안 Wi-Fi 명령을 받지 않는다. 초기화 직후에
// WiFi.begin() 을 부르면 25초를 기다려도 status 0 에서 멈췄고, 10초쯤 뒤에
// 부르면 바로 붙었다(C6 갱신을 시도하느라 우연히 늦어진 부팅에서 발견).
// 버전을 말해 주는 새 펌웨어에서는 필요 없어 보여서 구형일 때만 기다린다.
constexpr uint32_t kOldSlaveSettleMs = 10000;

static bool connectWifi(uint8_t attempts) {
    const WifiCreds c = wifiLoadCreds();

    static bool hooked = false;
    if (!hooked) {
        hooked = true;
        WiFi.onEvent(onWifiEvent);
    }

    for (uint8_t attempt = 1; attempt <= attempts; attempt++) {
        RLOGI("Wi-Fi 접속 시도 %u/%u: %s", (unsigned)attempt, (unsigned)attempts,
              c.ssid.c_str());
        if (attempt > 1) {
            WiFi.disconnect(true);
            delay(500);
        }

        // 첫 호출이 C6 를 리셋하고 SDIO 로 붙는다. 여기서 1.5초쯤 걸린다.
        const uint32_t hostedT0 = millis();
        WiFi.mode(WIFI_STA);
        if (attempt == 1) {
            const bool oldSlave = logHostedVersions();
            // 호스트와 C6 의 ESP-Hosted 버전이 다르면 접속이 안 된다. P4 에 박아
            // 둔 C6 펌웨어를 밀어 넣고 재시작한다. (c6update.h)
            if (c6UpdateIfNeeded([](uint8_t pct) {
                    setState(ST_UPDATING, "C6 " + String((unsigned)pct) + "%");
                    uiWake();
                    uiRender(snapshotUi());
                })) {
                setState(ST_UPDATING, "C6 DONE - RESTART");
                uiRender(snapshotUi());
                Serial.flush();
                delay(1500);
                ESP.restart();
            }
            if (oldSlave) {
                while (millis() - hostedT0 < kOldSlaveSettleMs) delay(100);
                RLOGI("구형 C6 펌웨어 — %lu ms 기다린 뒤 접속", (unsigned long)(millis() - hostedT0));
            }
        }
        WiFi.setSleep(WIFI_PS_NONE);
        WiFi.setAutoReconnect(true);
        WiFi.begin(c.ssid.c_str(), c.pass.c_str());

        const uint32_t waitMs = (attempts > 1 && attempt == 1) ? kWifiFirstTryMs : kWifiRetryMs;
        const uint32_t t0 = millis();
        while (WiFi.status() != WL_CONNECTED && millis() - t0 < waitMs) {
            delay(100);
        }
        if (WiFi.status() == WL_CONNECTED) {
            RLOGI("Wi-Fi 접속됨: %s", WiFi.localIP().toString().c_str());
            networkHealth.observe(true, WiFi.RSSI(), false);
            return true;
        }
        RLOGE("Wi-Fi 접속 실패 (status=%d)", (int)WiFi.status());
    }
    RLOGE("Wi-Fi 접속 포기: %s — 설정 포털로", c.ssid.c_str());
    return false;
}

static void runWifiPortal() {
    setState(ST_WIFISETUP);
    const bool saved = wifiRunPortal(
        kWifiPortalMs, [](const String& ap, const String& url, const String& pass) {
            UiState u;
            u.state = ST_WIFISETUP;
            u.apSsid = ap;
            u.apPass = pass;
            u.apUrl = url;
            u.detail = wifiReasonText();
            uiRenderWifiSetup(u);
        });

    if (saved) {
        RLOGI("새 Wi-Fi 정보 저장됨 — 재시작");
        tickSleepTimer();
        savePrefs();
        delay(300);
        ESP.restart();
    }
    RLOGE("설정 포털 시간 초과");
    setState(ST_ERROR, lastWifiReason ? ("NO WIFI r" + String((unsigned)lastWifiReason))
                                      : String("NO WIFI"));
}

static void setupOta() {
    ArduinoOTA.setHostname(OTA_HOSTNAME);
    ArduinoOTA.setPassword(OTA_PASSWORD);
    ArduinoOTA.onStart([]() {
        RLOGI("OTA 시작");
        // OTA 는 onStart 뒤 본문을 수신한다. 안전하게 정지할 수 없으면
        // 본문 쓰기 전에 재시작해 기존 펌웨어를 유지한다.
        if (!beginMaintenance()) { ESP.restart(); return; }
        savePrefs();
        setState(ST_UPDATING);
        uiWake();
        uiRender(snapshotUi());
    });
    ArduinoOTA.onProgress([](unsigned int done, unsigned int total) {
        static uint8_t last = 255;
        const uint8_t pct = total ? (uint8_t)(done * 100 / total) : 0;
        if (pct / 10 != last / 10) {
            last = pct;
            RLOGI("OTA %u%%", pct);
        }
    });
    ArduinoOTA.onError([](ota_error_t e) {
        RLOGE("OTA 실패: %u", (unsigned)e);
        lockShared();
        const bool wasMaintenance = shared.maintenance;
        unlockShared();
        if (wasMaintenance) {
            setState(ST_ERROR, "OTA FAIL");
            endMaintenance();
        }
    });
    ArduinoOTA.begin();
    RLOGI("OTA 대기: %s (%s)", OTA_HOSTNAME, WiFi.localIP().toString().c_str());
}

// ── setup / loop ──────────────────────────────────────────────────
static uint32_t lastUiMs = 0;

void setup() {
    // 이 보드의 Serial 은 USB CDC 가 아니라 UART0 -> CH343 브리지다. 링버퍼가
    // 차면 write 가 막히므로 오디오 태스크의 로그가 소리를 끊지 않게 넉넉히.
    Serial.setTxBufferSize(4096);
    Serial.begin(115200);
    delay(200);
    RLOGI("ESP32-P4 FM Radio  (CPU %u MHz, PSRAM %u KB)", (unsigned)getCpuFrequencyMhz(),
          (unsigned)(ESP.getPsramSize() / 1024));

    {
        const char* why = "?";
        switch (esp_reset_reason()) {
            case ESP_RST_POWERON:  why = "POWERON";  break;
            case ESP_RST_EXT:      why = "EXT";      break;
            case ESP_RST_SW:       why = "SW";       break;
            case ESP_RST_PANIC:    why = "PANIC";    break;
            case ESP_RST_INT_WDT:  why = "INT_WDT";  break;
            case ESP_RST_TASK_WDT: why = "TASK_WDT"; break;
            case ESP_RST_WDT:      why = "WDT";      break;
            case ESP_RST_DEEPSLEEP:why = "DEEPSLEEP";break;
            case ESP_RST_BROWNOUT: why = "BROWNOUT"; break;
            default:               why = "UNKNOWN";  break;
        }
        RLOGI("리셋 원인: %s", why);
    }

    // 내부 I2C 하나에 코덱 · 터치 · PMIC 가 다 있다. 여기서 한 번 연다.
    // 이 보드는 Arduino Wire 말고 다른 I2C 드라이버가 없으므로 그대로 쓴다.
    Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL, 400000UL);

    sharedLock = xSemaphoreCreateMutex();
    uiEventQueue = xQueueCreate(8, sizeof(UiEvent));
    loadPrefs();

    hwPmicBegin();
    touchBegin();
    uiBegin();
    pollSlowStatus();
    uiRender(snapshotUi());

    // 터치는 지금부터 받는다. Wi-Fi 를 기다리는 동안에도 화면은 깨어난다.
    xTaskCreatePinnedToCore(touchTask, "touch", 4096, nullptr, 2, nullptr, 0);

    setState(ST_WIFI);
    uiRender(snapshotUi());

    if (!connectWifi(kWifiAttempts)) {
        runWifiPortal();
        wifiRecovery = true;
        return;
    }
    setupOta();
    syncNtp();
    applyWifiPowerSave(true);

    RLOGI("I2S 설정 중... (BCLK=%d WS=%d DOUT=%d MCLK=%d)  힙=%u PSRAM=%u",
          (int)PIN_I2S_BCLK, (int)PIN_I2S_WS, (int)PIN_I2S_DOUT, (int)PIN_I2S_MCLK,
          (unsigned)ESP.getFreeHeap(), (unsigned)ESP.getFreePsram());
    if (!audio.setPinout(PIN_I2S_BCLK, PIN_I2S_WS, PIN_I2S_DOUT, PIN_I2S_MCLK)) {
        RLOGE("I2S setPinout 실패");
        setState(ST_ERROR, "NO I2S");
        uiRender(snapshotUi());
        return;
    }
    audio.setVolumeSteps(21);
    audio.setVolume(21);  // 라이브러리는 풀스케일, 실제 음량은 코덱이 담당
    audio.setConnectionTimeout(8000, 12000);
    // 방송 입력 주파수와 무관하게 I2S/코덱 출력 클록을 48kHz로 유지한다.
    audio.setOutputSampleRate(Audio::SR_48000);

    RLOGI("ES8311 초기화 중...");
    if (!codec.begin(PIN_I2C_SDA, PIN_I2C_SCL, AUDIO_SAMPLE_RATE, AUDIO_BITS,
                     AUDIO_MCLK_DIV, -1)) {
        setState(ST_ERROR, "NO CODEC");
        uiRender(snapshotUi());
        return;
    }
    codec.setMute(true);
    hwSpeakerAmp(false);
    RLOGI("코덱 준비 완료");

    Audio::audio_info_callback = [](Audio::msg_t m) {
        const bool meter = m.e == Audio::evt_vu || m.e == Audio::evt_spectrum;
        const bool noisy = (m.e == Audio::evt_info);
        if (m.msg && !meter && (AUDIO_VERBOSE_LOG || !noisy)) {
            Serial.printf("[A/%s] %s\n", m.s ? m.s : "?", m.msg);
        }
        switch (m.e) {
            case Audio::evt_vu:
                if (m.vec1.size() >= 4) {
                    lockShared();
                    shared.meters.left = meterByte(m.vec1[0]);
                    shared.meters.right = meterByte(m.vec1[1]);
                    shared.meters.peakLeft = meterByte(m.vec1[2]);
                    shared.meters.peakRight = meterByte(m.vec1[3]);
                    shared.meters.updatedMs = millis();
                    unlockShared();
                }
                break;
            case Audio::evt_spectrum:
                if (m.vec1.size() >= kSpectrumBands) {
                    lockShared();
                    for (uint8_t i = 0; i < kSpectrumBands; ++i)
                        shared.meters.bands[i] = meterByte(m.vec1[i]);
                    unlockShared();
                }
                break;
            case Audio::evt_bitrate:
                lockShared();
                shared.bitrate = (uint32_t)(m.arg1 > 0 ? m.arg1 : 0);
                unlockShared();
                break;
            case Audio::evt_eof:
                lockShared();
                if (!shared.paused && !shared.maintenance) {
                    shared.state = ST_ERROR;
                    shared.detail = "RECONNECT";
                }
                unlockShared();
                break;
            default:
                break;
        }
    };

